{
  "ayahs": [
    {
      "id": "2:261",
      "surah": "Al-Baqarah",
      "verse": "2:261",
      "arabic": "مَّثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ كَمَثَلِ حَبَّةٍ أَنۢبَتَتْ سَبْعَ سَنَابِلَ فِى كُلِّ سُنۢبُلَةٍ مِّا۟ئَةُ حَبَّةٍ ۗ وَٱللَّهُ يُضَٰعِفُ لِمَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "translation": {
        "en": "The example of those who spend their wealth in the way of Allah is like a seed [of grain] which grows seven spikes; in each spike is a hundred grains. And Allah multiplies [His reward] for whom He wills. And Allah is all-Encompassing and Knowing."
      }
    },
    {
      "id": "2:262",
      "surah": "Al-Baqarah",
      "verse": "2:262",
      "arabic": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّۭا وَلَآ أَذًۭى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "translation": {
        "en": "Those who spend their wealth in the way of Allah and do not follow up their spending by stressing their benevolence and causing hurt, will find their reward secure with their Lord. They have no cause for fear and grief."
      }
    },
    {
      "id": "2:263",
      "surah": "Al-Baqarah",
      "verse": "2:263",
      "arabic": "قَوْلٌۭ مَّعْرُوفٌۭ وَمَغْفِرَةٌ خَيْرٌۭ مِّن صَدَقَةٍۢ يَتْبَعُهَآ أَذًۭى ۗ وَٱللَّهُ غَنِىٌّ حَلِيمٌۭ",
      "translation": {
        "en": "Kind words and forgiving of faults are better than sadaqah (charity) followed by injury. And Allah is Rich (Free of all wants) and He is Most-Forbearing."
      }
    },
    {
      "id": "2:264",
      "surah": "Al-Baqarah",
      "verse": "2:264",
      "arabic": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تُبْطِلُوا۟ صَدَقَـٰتِكُم بِٱلْمَنِّ وَٱلْأَذَىٰ كَٱلَّذِى يُنفِقُ مَالَهُۥ رِئَآءَ ٱلنَّاسِ وَلَا يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۖ فَمَثَلُهُۥ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌۭ فَأَصَابَهُۥ وَابِلٌۭ فَتَرَكَهُۥ صَلْدًۭا ۖ لَّا يَقْدِرُونَ عَلَىٰ شَىْءٍۢ مِّمَّا كَسَبُوا۟ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْكَـٰفِرِينَ",
      "translation": {
        "en": "O you who have believed, do not nullify your charitable deeds with reminders or injury as does one who spends his wealth [only] to be seen by the people and does not believe in Allah and the Last Day. His example is like that of a [large] smooth stone upon which is dust and is hit by a downpour that leaves it bare. They are unable [to keep] anything of what they have earned. And Allah does not guide the disbelieving people."
      }
    },
    {
      "id": "2:265",
      "surah": "Al-Baqarah",
      "verse": "2:265",
      "arabic": "وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمُ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ وَتَثْبِيتًۭا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍۭ بِرَبْوَةٍ أَصَابَهَا وَابِلٌۭ فَـَٔاتَتْ أُكُلَهَا ضِعْفَيْنِ فَإِن لَّمْ يُصِبْهَا وَابِلٌۭ فَطَلٌّ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌۭ",
      "translation": {
        "en": "And the example of those who spend their wealth seeking means to the approval of Allah and assuring [reward for] themselves is like a garden [high] upon a hill which is hit by a downpour - so it yields its fruits in double. And [even] if it is not hit by a downpour, then a drizzle [is sufficient]. And Allah, of what you do, is Seeing."
      }
    },
    {
      "id": "2:270",
      "surah": "Al-Baqarah",
      "verse": "2:270",
      "arabic": "وَمَآ أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍۢ فَإِنَّ ٱللَّهَ يَعْلَمُهُۥ ۗ وَمَا لِلظَّـٰلِمِينَ مِنْ أَنصَارٍ",
      "translation": {
        "en": "And whatever you spend of expenditures or make of vows - indeed, Allah knows of it. And for the wrongdoers there are no helpers."
      }
    },
    {
      "id": "2:271",
      "surah": "Al-Baqarah",
      "verse": "2:271",
      "arabic": "إِن تُبْدُوا۟ ٱلصَّدَقَـٰتِ فَنِعِمَّا هِىَ ۖ وَإِن تُخْفُوهَا وَتُؤْتُوهَا ٱلْفُقَرَآءَ فَهُوَ خَيْرٌۭ لَّكُمْ ۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمْ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌۭ",
      "translation": {
        "en": "If you disclose your charitable expenditures, they are good; but if you conceal them and give them to the poor, it is better for you, and He will remove from you some of your misdeeds. And Allah, with what you do, is [fully] Acquainted."
      }
    },
    {
      "id": "2:272",
      "surah": "Al-Baqarah",
      "verse": "2:272",
      "arabic": "لَّيْسَ عَلَيْكَ هُدَىٰهُمْ وَلَـٰكِنَّ ٱللَّهَ يَهْدِى مَن يَشَآءُ ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ فَلِأَنفُسِكُمْ ۚ وَمَا تُنفِقُونَ إِلَّا ٱبْتِغَآءَ وَجْهِ ٱللَّهِ ۚ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لَا تُظْلَمُونَ",
      "translation": {
        "en": "Not upon you, [O Muhammad], is [responsibility for] their guidance, but Allah guides whom He wills. And whatever good you [believers] spend is for yourselves, and you do not spend except seeking the countenance of Allah. And whatever you spend of good - it will be fully repaid to you, and you will not be wronged."
      }
    },
    {
      "id": "2:273",
      "surah": "Al-Baqarah",
      "verse": "2:273",
      "arabic": "لِلْفُقَرَآءِ ٱلَّذِينَ أُحْصِرُوا۟ فِى سَبِيلِ ٱللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًۭا فِى ٱلْأَرْضِ يَحْسَبُهُمُ ٱلْجَاهِلُ أَغْنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعْرِفُهُم بِسِيمَـٰهُمْ لَا يَسْـَٔلُونَ ٱلنَّاسَ إِلْحَافًۭا ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌۭ",
      "translation": {
        "en": "[Charity is] for the poor who have been restricted for the cause of Allah, unable to move about in the land. An ignorant [person] would think them self-sufficient because of their restraint, but you will know them by their [characteristic] sign. They do not ask people persistently [or at all]. And whatever you spend of good - indeed, Allah is Knowing of it."
      }
    },
    {
      "id": "2:274",
      "surah": "Al-Baqarah",
      "verse": "2:274",
      "arabic": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّۭا وَعَلَانِيَةًۭ فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "translation": {
        "en": "Those who spend their wealth [in Allah's way] by night and by day, secretly and publicly - they will have their reward with their Lord. And no fear will there be concerning them, nor will they grieve."
      }
    },
    {
      "id": "2:276",
      "surah": "Al-Baqarah",
      "verse": "2:276",
      "arabic": "يَمْحَقُ ٱللَّهُ ٱلرِّبَوٰا۟ وَيُرْبِى ٱلصَّدَقَـٰتِ ۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍۢ",
      "translation": {
        "en": "Allah destroys interest and gives increase for charities. And Allah does not like every sinning disbeliever."
      }
    },
    {
      "id": "2:280",
      "surah": "Al-Baqarah",
      "verse": "2:280",
      "arabic": "وَإِن كَانَ ذُو عُسْرَةٍۢ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍۢ ۚ وَأَن تَصَدَّقُوا۟ خَيْرٌۭ لَّكُمْ ۖ إِن كُنتُمْ تَعْلَمُونَ",
      "translation": {
        "en": "And if someone is in hardship, then [let there be] postponement until [a time of] ease. But if you give [from your right as] charity, then it is better for you, if you only knew."
      }
    },
    {
      "id": "3:92",
      "surah": "Aal-E-Imran",
      "verse": "3:92",
      "arabic": "لَن تَنَالُوا۟ ٱلْبِرَّ حَتَّىٰ تُنفِقُوا۟ مِمَّا تُحِبُّونَ ۚ وَمَا تُنفِقُوا۟ مِن شَىْءٍۢ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌۭ",
      "translation": {
        "en": "Never will you attain the good [reward] until you spend [in the way of Allah] from that which you love. And whatever you spend - indeed, Allah is Knowing of it."
      }
    },
    {
      "id": "4:114",
      "surah": "An-Nisa",
      "verse": "4:114",
      "arabic": "لَّا خَيْرَ فِى كَثِيرٍۢ مِّن نَّجْوَىٰهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَـٰحٍۭ بَيْنَ ٱلنَّاسِ ۗ وَمَن يَفْعَلْ ذَٰلِكَ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا",
      "translation": {
        "en": "There is no good in most of their secret talks save (in) him who orders sadaqah (charity in Allah's Cause), or Ma'ruf (Islamic Monotheism and all the good and righteous deeds which Allah has ordained), or conciliation between mankind, and he who does this, seeking the good Pleasure of Allah, We shall give him a great reward."
      }
    },
    {
      "id": "5:12",
      "surah": "Al-Ma'idah",
      "verse": "5:12",
      "arabic": "وَلَقَدْ أَخَذَ ٱللَّهُ مِيثَـٰقَ بَنِىٓ إِسْرَٰٓءِيلَ وَبَعَثْنَا مِنْهُمُ ٱثْنَىْ عَشَرَ نَقِيبًۭا ۖ وَقَالَ ٱللَّهُ إِنِّى مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ ٱلصَّلَوٰةَ وَءَاتَيْتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِى وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ ٱللَّهَ قَرْضًا حَسَنًۭا لَّأُكَفِّرَنَّ عَنكُمْ سَيِّـَٔاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۚ فَمَن كَفَرَ بَعْدَ ذَٰلِكَ مِنكُمْ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
      "translation": {
        "en": "And Allah had already taken a covenant from the Children of Israel, and We delegated from among them twelve leaders. And Allah said, 'I am with you. If you establish prayer and give zakah and believe in My messengers and support them and loan Allah a goodly loan, I will surely remove from you your misdeeds and admit you to gardens beneath which rivers flow. But whoever of you disbelieves after that has certainly gone astray from the soundness of the way.'"
      }
    },
    {
      "id": "5:55",
      "surah": "Al-Ma'idah",
      "verse": "5:55",
      "arabic": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُوا۟ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَهُمْ رَٰكِعُونَ",
      "translation": {
        "en": "Your ally is none but Allah and [therefore] His Messenger and those who have believed - those who establish prayer and give zakah, and they bow [in worship]."
      }
    },
    {
      "id": "9:18",
      "surah": "At-Tawbah",
      "verse": "9:18",
      "arabic": "إِنَّمَا يَعْمُرُ مَسَـٰجِدَ ٱللَّهِ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَلَمْ يَخْشَ إِلَّا ٱللَّهَ ۖ فَعَسَىٰٓ أُو۟لَـٰٓئِكَ أَن يَكُونُوا۟ مِنَ ٱلْمُهْتَدِينَ",
      "translation": {
        "en": "The mosques of Allah are only to be maintained by those who believe in Allah and the Last Day and establish prayer and give zakah and do not fear except Allah, for it is expected that those will be of the [rightly] guided."
      }
    },
    {
      "id": "9:60",
      "surah": "At-Tawbah",
      "verse": "9:60",
      "arabic": "إِنَّمَا ٱلصَّدَقَـٰتُ لِلْفُقَرَآءِ وَٱلْمَسَـٰكِينِ وَٱلْعَـٰمِلِينَ عَلَيْهَا وَٱلْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِى ٱلرِّقَابِ وَٱلْغَـٰرِمِينَ وَفِى سَبِيلِ ٱللَّهِ وَٱبْنِ ٱلسَّبِيلِ ۖ فَرِيضَةًۭ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌۭ",
      "translation": {
        "en": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise."
      }
    },
    {
      "id": "9:75-76",
      "surah": "At-Tawbah",
      "verse": "9:75-76",
      "arabic": "وَمِنْهُم مَّنْ عَـٰهَدَ ٱللَّهَ لَئِنْ ءَاتَىٰنَا مِن فَضْلِهِۦ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ ٱلصَّـٰلِحِينَ ۝ فَلَمَّآ ءَاتَىٰهُم مِّن فَضْلِهِۦ بَخِلُوا۟ بِهِۦ وَتَوَلَّوا۟ وَّهُم مُّعْرِضُونَ",
      "translation": {
        "en": "And of them are some who made a covenant with Allah [saying], 'If He should give us from His bounty, we will surely spend in charity, and we will surely be among the righteous.' But when He gave them from His bounty, they were stingy with it and turned away while they refused."
      }
    },
    {
      "id": "9:103",
      "surah": "At-Tawbah",
      "verse": "9:103",
      "arabic": "خُذْ مِنْ أَمْوَٰلِهِمْ صَدَقَةًۭ تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ ۖ إِنَّ صَلَوَٰتَكَ سَكَنٌۭ لَّهُمْ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌۭ",
      "translation": {
        "en": "Take, [O, Muhammad], from their wealth a charity by which you purify them and cause them increase, and invoke [Allah's blessings] upon them. Indeed, your invocations are reassurance for them. And Allah is Hearing and Knowing."
      }
    },
    {
      "id": "9:104",
      "surah": "At-Tawbah",
      "verse": "9:104",
      "arabic": "أَلَمْ يَعْلَمُوٓا۟ أَنَّ ٱللَّهَ هُوَ يَقْبَلُ ٱلتَّوْبَةَ عَنْ عِبَادِهِۦ وَيَأْخُذُ ٱلصَّدَقَـٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "translation": {
        "en": "Do they not know that it is Allah who accepts repentance from His servants and receives charities and that it is Allah who is the Accepting of repentance, the Merciful?"
      }
    },
    {
      "id": "19:31",
      "surah": "Maryam",
      "verse": "19:31",
      "arabic": "وَجَعَلَنِى مُبَارَكًا أَيْنَ مَا كُنتُ وَأَوْصَـٰنِى بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ مَا دُمْتُ حَيًّۭا",
      "translation": {
        "en": "And He has made me blessed wherever I am and has enjoined upon me prayer and zakah as long as I remain alive"
      }
    },
    {
      "id": "21:73",
      "surah": "Al-Anbiya",
      "verse": "21:73",
      "arabic": "وَجَعَلْنَـٰهُمْ أَئِمَّةًۭ يَهْدُونَ بِأَمْرِنَا وَأَوْحَيْنَآ إِلَيْهِمْ فِعْلَ ٱلْخَيْرَٰتِ وَإِقَامَ ٱلصَّلَوٰةِ وَإِيتَآءَ ٱلزَّكَوٰةِ ۖ وَكَانُوا۟ لَنَا عَـٰبِدِينَ",
      "translation": {
        "en": "And We made them leaders guiding by Our command. And We inspired to them the doing of good deeds, establishment of prayer, and giving of zakah; and they were worshippers of Us."
      }
    },
    {
      "id": "22:35",
      "surah": "Al-Hajj",
      "verse": "22:35",
      "arabic": "ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتْ قُلُوبُهُمْ وَٱلصَّـٰبِرِينَ عَلَىٰ مَآ أَصَابَهُمْ وَٱلْمُقِيمِى ٱلصَّلَوٰةِ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "translation": {
        "en": "Who, when Allah is mentioned, their hearts are fearful, and [to] the patient over what has afflicted them, and the establishers of prayer and those who spend from what We have provided them."
      }
    },
    {
      "id": "22:41",
      "surah": "Al-Hajj",
      "verse": "22:41",
      "arabic": "ٱلَّذِينَ إِن مَّكَّنَّـٰهُمْ فِى ٱلْأَرْضِ أَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ وَأَمَرُوا۟ بِٱلْمَعْرُوفِ وَنَهَوْا۟ عَنِ ٱلْمُنكَرِ ۗ وَلِلَّهِ عَـٰقِبَةُ ٱلْأُمُورِ",
      "translation": {
        "en": "[And they are] those who, if We give them authority in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of [all] matters."
      }
    },
    {
      "id": "22:78",
      "surah": "Al-Hajj",
      "verse": "22:78",
      "arabic": "وَجَـٰهِدُوا۟ فِى ٱللَّهِ حَقَّ جِهَادِهِۦ ۚ هُوَ ٱجْتَبَىٰكُمْ وَمَا جَعَلَ عَلَيْكُمْ فِى ٱلدِّينِ مِنْ حَرَجٍۢ ۚ مِّلَّةَ أَبِيكُمْ إِبْرَٰهِيمَ ۚ هُوَ سَمَّىٰكُمُ ٱلْمُسْلِمِينَ مِن قَبْلُ وَفِى هَـٰذَا لِيَكُونَ ٱلرَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُوا۟ شُهَدَآءَ عَلَى ٱلنَّاسِ ۚ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱعْتَصِمُوا۟ بِٱللَّهِ هُوَ مَوْلَىٰكُمْ ۖ فَنِعْمَ ٱلْمَوْلَىٰ وَنِعْمَ ٱلنَّصِيرُ",
      "translation": {
        "en": "And strive for Allah with the striving due to Him. He has chosen you and has not placed upon you in the religion any difficulty. [It is] the religion of your father, Abraham. Allah named you 'Muslims' before [in former scriptures] and in this [revelation] that the Messenger may be a witness over you and you may be witnesses over the people. So establish prayer and give zakah and hold fast to Allah. He is your protector; and excellent is the protector, and excellent is the helper."
      }
    },
    {
      "id": "24:37",
      "surah": "An-Nur",
      "verse": "24:37",
      "arabic": "رِجَالٌۭ لَّا تُلْهِيهِمْ تِجَـٰرَةٌۭ وَلَا بَيْعٌ عَن ذِكْرِ ٱللَّهِ وَإِقَامِ ٱلصَّلَوٰةِ وَإِيتَآءِ ٱلزَّكَوٰةِ ۙ يَخَافُونَ يَوْمًۭا تَتَقَلَّبُ فِيهِ ٱلْقُلُوبُ وَٱلْأَبْصَـٰرُ",
      "translation": {
        "en": "[Are] men whom neither commerce nor sale distracts from the remembrance of Allah and performance of prayer and giving of zakah. They fear a Day in which the hearts and eyes will [fearfully] turn about"
      }
    },
    {
      "id": "27:3",
      "surah": "An-Naml",
      "verse": "27:3",
      "arabic": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلْـَٔاخِرَةِ هُمْ يُوقِنُونَ",
      "translation": {
        "en": "Who establish prayer and give zakah, and of the Hereafter they are certain [in faith]."
      }
    },
    {
      "id": "30:39",
      "surah": "Ar-Rum",
      "verse": "30:39",
      "arabic": "وَمَآ ءَاتَيْتُم مِّن رِّبًۭا لِّيَرْبُوَا۟ فِىٓ أَمْوَٰلِ ٱلنَّاسِ فَلَا يَرْبُوا۟ عِندَ ٱللَّهِ ۖ وَمَا ءَاتَيْتُم مِّن زَكَوٰةٍۢ تُرِيدُونَ وَجْهَ ٱللَّهِ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُضْعِفُونَ",
      "translation": {
        "en": "And whatever you give for interest to increase within the wealth of people will not increase with Allah. But what you give in zakah, desiring the countenance of Allah - those are the multipliers [of reward]."
      }
    },
    {
      "id": "31:4",
      "surah": "Luqman",
      "verse": "31:4",
      "arabic": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤْتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلْـَٔاخِرَةِ هُمْ يُوقِنُونَ",
      "translation": {
        "en": "Those who establish prayer and give zakah, and they, of the Hereafter, are certain."
      }
    },
    {
      "id": "33:33",
      "surah": "Al-Ahzab",
      "verse": "33:33",
      "arabic": "وَقَرْنَ فِى بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلْأُولَىٰ ۖ وَأَقِمْنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُۥٓ ۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًۭا",
      "translation": {
        "en": "And abide in your houses and do not display yourselves as [was] the display of the former times of ignorance. And establish prayer and give zakah and obey Allah and His Messenger. Allah intends only to remove from you the impurity [of sin], O people of the [Prophet's] household, and to purify you with [extensive] purification."
      }
    },
    {
      "id": "41:7",
      "surah": "Fussilat",
      "verse": "41:7",
      "arabic": "ٱلَّذِينَ لَا يُؤْتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلْـَٔاخِرَةِ هُمْ كَـٰفِرُونَ",
      "translation": {
        "en": "Those who do not give zakah, and in the Hereafter they are disbelievers."
      }
    },
    {
      "id": "57:7",
      "surah": "Al-Hadid",
      "verse": "57:7",
      "arabic": "ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَأَنفِقُوا۟ مِمَّا جَعَلَكُم مُّسْتَخْلَفِينَ فِيهِ ۖ فَٱلَّذِينَ ءَامَنُوا۟ مِنكُمْ وَأَنفَقُوا۟ لَهُمْ أَجْرٌۭ كَبِيرٌۭ",
      "translation": {
        "en": "Believe in Allah and His Messenger and spend out of that in which He has made you successors. For those who have believed among you and spent, there will be a great reward."
      }
    },
    {
      "id": "57:10",
      "surah": "Al-Hadid",
      "verse": "57:10",
      "arabic": "وَمَا لَكُمْ أَلَّا تُنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ لَا يَسْتَوِى مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ ٱلْفَتْحِ وَقَـٰتَلَ ۚ أُو۟لَـٰٓئِكَ أَعْظَمُ دَرَجَةًۭ مِّنَ ٱلَّذِينَ أَنفَقُوا۟ مِنۢ بَعْدُ وَقَـٰتَلُوا۟ ۚ وَكُلًّۭا وَعَدَ ٱللَّهُ ٱلْحُسْنَىٰ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌۭ",
      "translation": {
        "en": "And why do you not spend in the cause of Allah while to Allah belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]. Those are greater in degree than they who spent afterwards and fought. But to all Allah has promised the best [reward]. And Allah, with what you do, is Acquainted."
      }
    },
    {
      "id": "57:11",
      "surah": "Al-Hadid",
      "verse": "57:11",
      "arabic": "مَّن ذَا ٱلَّذِى يُقْرِضُ ٱللَّهَ قَرْضًا حَسَنًۭا فَيُضَٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجْرٌۭ كَرِيمٌۭ",
      "translation": {
        "en": "Who is he that will lend Allah a goodly loan, then (Allah) will increase it manifold to his credit (in repaying), and he will have (besides) a good reward (i.e. Paradise)."
      }
    },
    {
      "id": "57:18",
      "surah": "Al-Hadid",
      "verse": "57:18",
      "arabic": "إِنَّ ٱلْمُصَّدِّقِينَ وَٱلْمُصَّدِّقَـٰتِ وَأَقْرَضُوا۟ ٱللَّهَ قَرْضًا حَسَنًۭا يُضَٰعَفُ لَهُمْ وَلَهُمْ أَجْرٌۭ كَرِيمٌۭ",
      "translation": {
        "en": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan - it will be multiplied for them, and they will have a noble reward."
      }
    },
    {
      "id": "58:12",
      "surah": "Al-Mujadila",
      "verse": "58:12",
      "arabic": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا نَـٰجَيْتُمُ ٱلرَّسُولَ فَقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَةًۭ ۚ ذَٰلِكَ خَيْرٌۭ لَّكُمْ وَأَطْهَرُ ۚ فَإِن لَّمْ تَجِدُوا۟ فَإِنَّ ٱللَّهَ غَفُورٌۭ رَّحِيمٌ",
      "translation": {
        "en": "O you who have believed, when you [wish to] privately consult the Messenger, present before your consultation a charity. That is better for you and purer. But if you find not [the means] - then indeed, Allah is Forgiving and Merciful."
      }
    },
    {
      "id": "58:13",
      "surah": "Al-Mujadila",
      "verse": "58:13",
      "arabic": "ءَأَشْفَقْتُمْ أَن تُقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَـٰتٍۭ ۚ فَإِذْ لَمْ تَفْعَلُوا۟ وَتَابَ ٱللَّهُ عَلَيْكُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَطِيعُوا۟ ٱللَّهَ وَرَسُولَهُۥ ۚ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "translation": {
        "en": "Have you feared to present before your consultation charities? Then when you do not and Allah has forgiven you, then [at least] establish prayer and give zakah and obey Allah and His Messenger. And Allah is Acquainted with what you do."
      }
    },
    {
      "id": "63:10",
      "surah": "Al-Munafiqun",
      "verse": "63:10",
      "arabic": "وَأَنفِقُوا۟ مِمَّا رَزَقْنَـٰكُم مِّن قَبْلِ أَن يَأْتِىَ أَحَدَكُمُ ٱلْمَوْتُ فَيَقُولَ رَبِّ لَوْلَآ أَخَّرْتَنِىٓ إِلَىٰٓ أَجَلٍۢ قَرِيبٍۢ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّـٰلِحِينَ",
      "translation": {
        "en": "And spend [in the way of Allah] from what We have provided you before death approaches one of you and he says, 'My Lord, if only You would delay me for a brief term so I would give charity and be among the righteous.'"
      }
    },
    {
      "id": "64:16",
      "surah": "At-Taghabun",
      "verse": "64:16",
      "arabic": "فَٱتَّقُوا۟ ٱللَّهَ مَا ٱسْتَطَعْتُمْ وَٱسْمَعُوا۟ وَأَطِيعُوا۟ وَأَنفِقُوا۟ خَيْرًۭا لِّأَنفُسِكُمْ ۗ وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "translation": {
        "en": "So fear Allah as much as you are able and listen and obey and spend [in the way of Allah]; it is better for your selves. And whoever is protected from the stinginess of his soul - it is those who will be the successful."
      }
    },
    {
      "id": "70:24-25",
      "surah": "Al-Ma'arij",
      "verse": "70:24-25",
      "arabic": "وَٱلَّذِينَ فِىٓ أَمْوَٰلِهِمْ حَقٌّۭ مَّعْلُومٌۭ ۝ لِّلسَّآئِلِ وَٱلْمَحْرُومِ",
      "translation": {
        "en": "And those within whose wealth is a known right - For the petitioner and the deprived -"
      }
    },
    {
      "id": "74:6",
      "surah": "Al-Muddaththir",
      "verse": "74:6",
      "arabic": "وَلَا تَمْنُن تَسْتَكْثِرُ",
      "translation": {
        "en": "And do not confer favor to acquire more"
      }
    },
    {
      "id": "98:5",
      "surah": "Al-Bayyinah",
      "verse": "98:5",
      "arabic": "وَمَآ أُمِرُوٓا۟ إِلَّا لِيَعْبُدُوا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ وَيُقِيمُوا۟ ٱلصَّلَوٰةَ وَيُؤْتُوا۟ ٱلزَّكَوٰةَ ۚ وَذَٰلِكَ دِينُ ٱلْقَيِّمَةِ",
      "translation": {
        "en": "And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion."
      }
    }
  ],
  "hadiths": [
    {
      "id": "bukhari-2989",
      "number": 1,
      "arabic": "‏ صَدَقَةٌ عَلَى كُلِّ مَفْصِلٍ مِنْ مَفَاصِلِ ابْنِ آدَمَ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ، تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَكُلُّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلاَةِ صَدَقَةٌ، وَتُمِيطُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ",
      "source": "Sahih al-Bukhari 2989, Sahih Muslim 1009",
      "translation": {
        "en": "A charity is due for every joint in each person on every day the sun comes up: to act justly between two people is a charity; to help a man with his mount, lifting him onto it or hoisting up his belongings onto it, is a charity; a good word is a charity; and removing a harmful thing from the road is a charity."
      }
    },
    {
      "id": "tirmidhi-589",
      "number": 2,
      "arabic": "‏ تَصَدَّقُواْ أَنْ تَصْدَمَكُمْ الأَهْوَالُ",
      "source": "Sunan al-Tirmidhi 589 (Hasan)",
      "translation": {
        "en": "Give charity without delay, for it stands in the way of calamity."
      }
    },
    {
      "id": "muslim-2588",
      "number": 3,
      "arabic": "مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ، وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا، وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلاَّ رَفَعَهُ اللَّهُ",
      "source": "Sahih Muslim 2588",
      "translation": {
        "en": "Charity does not decrease wealth, no one forgives another except that Allah increases his honour, and no one humbles himself for the sake of Allah except that Allah raises his status."
      }
    },
    {
      "id": "muslim-1631",
      "number": 4,
      "arabic": "إِذَا مَاتَ ابْنُ آدَمَ انْقَطَعَ عَمَلُهُ إِلاَّ مِنْ ثَلاَثٍ: صَدَقَةٌ جَارِيَةٌ، أَوْ عِلْمٌ يُنْتَفَعُ بِهِ، أَوْ وَلَدٌ صَالِحٌ يَدْعُو لَهُ",
      "source": "Sahih Muslim 1631",
      "translation": {
        "en": "When a man dies, his deeds come to an end except for three things: Sadaqah Jariyah (ceaseless charity); a knowledge which is beneficial, or a virtuous descendant who prays for him (for the deceased)."
      }
    },
    {
      "id": "tirmidhi-1926",
      "number": 5,
      "arabic": "إِنَّ الظِّلَّ يَوْمَ الْقِيَامَةِ لِصَدَقَةِ الْمُؤْمِنِ",
      "source": "Sunan al-Tirmidhi 1926 (Hasan)",
      "translation": {
        "en": "The believer's shade on the Day of Resurrection will be his charity."
      }
    },
    {
      "id": "bukhari-1417",
      "number": 6,
      "arabic": "تَحَرَّوْا أَنْ تَدْخُلُوا الْجَنَّةَ بِأَدْنَى شَيْءٍ مِنْ صَدَقَةٍ، وَاتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ",
      "source": "Sahih al-Bukhari 1417, Sahih Muslim 1016",
      "translation": {
        "en": "Protect yourself from Hellfire even by giving a piece of date as charity."
      }
    },
    {
      "id": "bukhari-4684",
      "number": 7,
      "arabic": "قَالَ اللَّهُ: أَنْفِقْ يَا ابْنَ آدَمَ أُنْفِقْ عَلَيْكَ",
      "source": "Sahih al-Bukhari 4684, Sahih Muslim 993",
      "translation": {
        "en": "Allah, the Exalted, says, 'Spend, O son of Adam, and I shall spend on you.'"
      }
    },
    {
      "id": "muslim-2578",
      "number": 8,
      "arabic": "اتَّقُوا الظُّلْمَ، فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ، وَاتَّقُوا الشُّحَّ، فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ، حَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمَهُمْ",
      "source": "Sahih Muslim 2578",
      "translation": {
        "en": "Avoid doing injustice to others, for on the Day of Judgment, it will turn into manifold darkness, and safeguard yourself against miserliness, for it ruined those who were before you. It incited them to murder and treating the unlawful as lawful."
      }
    },
    {
      "id": "ibn-majah-3684",
      "number": 9,
      "arabic": "خَيْرُ الصَّدَقَةِ سَقْىُ الْمَاءِ",
      "source": "Sunan Ibn Majah 3684 (Hasan)",
      "translation": {
        "en": "The Prophet Muhammad (PBUH) was asked: 'Which charity is best?' He replied: 'Providing water.'"
      }
    },
    {
      "id": "abi-dawud-5142",
      "number": 10,
      "arabic": "جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ، هَلْ بَقِيَ مِنْ بِرِّ أَبَوَيَّ شَيْءٌ أَبِرُّهُمَا بِهِ بَعْدَ مَوْتِهِمَا؟ قَالَ: نَعَمْ، الصَّلاَةُ عَلَيْهِمَا، وَالاِسْتِغْفَارُ لَهُمَا، وَإِنْفَاذُ عَهْدِهِمَا مِنْ بَعْدِهِمَا، وَصِلَةُ الرَّحِمِ الَّتِي لاَ تُوصَلُ إِلاَّ بِهِمَا، وَإِكْرَامُ صَدِيقِهِمَا",
      "source": "Sunan Abi Dawud 5142",
      "translation": {
        "en": "A man came to the Prophet Muhammad (PBUH) and asked: 'O Messenger of Allah, is there any way of honouring my parents after their death?' The Prophet (peace be upon him) replied: 'Yes, by praying for them, asking forgiveness for them, fulfilling their promises after them, maintaining ties with those who are close to them, and honouring their friends.'"
      }
    },
    {
      "id": "tirmidhi-1962",
      "number": 11,
      "arabic": "لاَ يَدْخُلُ الْجَنَّةَ خَبٌّ وَلاَ مَنَّانٌ وَلاَ بَخِيلٌ",
      "source": "Sunan al-Tirmidhi 1962 (Sahih)",
      "translation": {
        "en": "A crafty one, a miser, and one who keeps reminding people of what he has given, will not enter Paradise."
      }
    },
    {
      "id": "muslim-1005",
      "number": 13,
      "arabic": "كُلُّ مَعْرُوفٍ صَدَقَةٌ",
      "source": "Sahih Muslim 1005",
      "translation": {
        "en": "Every good deed is charity."
      }
    },
    {
      "id": "tirmidhi-1956",
      "number": 14,
      "arabic": "تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ صَدَقَةٌ",
      "source": "Sunan al-Tirmidhi 1956 (Hasan)",
      "translation": {
        "en": "Your smiling in the face of your brother is charity."
      }
    },
    {
      "id": "bukhari-1423",
      "number": 19,
      "arabic": "سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ... وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ",
      "source": "Sahih al-Bukhari 1423, Sahih Muslim 1031",
      "translation": {
        "en": "Seven are [the people] whom Allah will give shade on the Day when there will be no shade but His... [including] a man who gives charity and conceals it so much so that his left hand does not know what his right hand has given."
      }
    },
    {
      "id": "bukhari-1",
      "number": 18,
      "arabic": "إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى",
      "source": "Sahih al-Bukhari 1, Sahih Muslim 1907",
      "note": "This hadith emphasizes the importance of sincere intention when giving charity.",
      "translation": {
        "en": "Actions are but by intentions, and every person will have what they intended."
      }
    }
  ]
}